In [33]:
import pandas as pd

In [32]:
df=pd.read_csv('test.csv')

In [34]:
df

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%)
0,01-Jul-25,"3,150",38,82.89,3.2,11.0,27,55,280,"1,500","1,050",600,38.0
1,02-Jul-25,NaN,45,93.33,4.1,18.0,27,42,310,"2,100","1,500",600,NaN
2,03-Jul-25,"3,800",41,92.68,3.7,15.0,26,48,295,"1,900",NaN,600,39.0
3,04-Jul-25,"5,500",60,91.67,5.3,NaN,35,35,350,"2,800","2,000",700,NaN

In [21]:
# fetch first 5 row
df.head(5)

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%)
0,01-Jul-25,"3,150",38,82.89,3.2,11.0,27,55,280,"1,500","1,050",600,38
1,02-Jul-25,NaN,45,93.33,4.1,18.0,27,42,310,"2,100","1,500",600,40
2,03-Jul-25,"3,800",41,92.68,3.7,15.0,26,48,295,"1,900",NaN,600,39
3,04-Jul-25,"5,500",60,91.67,5.3,NaN,35,35,350,"2,800","2,000",700,42

In [27]:
df['Total Sales ($)']

0    3,150
1      NaN
2    3,800
3    5,500
Name: Total Sales ($), dtype: object

In [22]:
df.describe()

,Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product C Sales ($),Average Profit Margin (%)
count,4.000000,4.0000,4.000000,3.000000,4.000000,4.000000,4.000000,4.0,4.000000
mean,46.000000,90.1425,4.075000,14.666667,28.750000,45.000000,308.750000,625.0,39.750000
std,9.763879,4.8830,0.895824,3.511885,4.193249,8.524475,30.103986,50.0,1.707825
min,38.000000,82.8900,3.200000,11.000000,26.000000,35.000000,280.000000,600.0,38.000000
25%,40.250000,89.4750,3.575000,13.000000,26.750000,40.250000,291.250000,600.0,38.750000
50%,43.000000,92.1750,3.900000,15.000000,27.000000,45.000000,302.500000,600.0,39.500000
75%,48.750000,92.8425,4.400000,16.500000,29.000000,49.750000,320.000000,625.0,40.500000
max,60.000000,93.3300,5.300000,18.000000,35.000000,55.000000,350.000000,700.0,42.000000

In [10]:
df.dtypes

Date                              object
Total Sales ($)                   object
Number of Orders                   int64
Average Order Value ($)          float64
Conversion Rate (%)              float64
New Customers                      int64
Returning Customers                int64
Customer Acquisition Cost ($)      int64
Customer Lifetime Value ($)        int64
Product A Sales ($)               object
Product B Sales ($)               object
Product C Sales ($)                int64
Average Profit Margin (%)          int64
dtype: object

In [23]:
#handling missing value
df.isnull().any()

Date                             False
Total Sales ($)                   True
Number of Orders                 False
Average Order Value ($)          False
Conversion Rate (%)              False
New Customers                     True
Returning Customers              False
Customer Acquisition Cost ($)    False
Customer Lifetime Value ($)      False
Product A Sales ($)              False
Product B Sales ($)               True
Product C Sales ($)              False
Average Profit Margin (%)        False
dtype: bool

In [24]:
df.isnull().sum()

Date                             0
Total Sales ($)                  1
Number of Orders                 0
Average Order Value ($)          0
Conversion Rate (%)              0
New Customers                    1
Returning Customers              0
Customer Acquisition Cost ($)    0
Customer Lifetime Value ($)      0
Product A Sales ($)              0
Product B Sales ($)              1
Product C Sales ($)              0
Average Profit Margin (%)        0
dtype: int64

In [35]:
# fill replace value

df.fillna(0)

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%)
0,01-Jul-25,"3,150",38,82.89,3.2,11.0,27,55,280,"1,500","1,050",600,38.0
1,02-Jul-25,0,45,93.33,4.1,18.0,27,42,310,"2,100","1,500",600,0.0
2,03-Jul-25,"3,800",41,92.68,3.7,15.0,26,48,295,"1,900",0,600,39.0
3,04-Jul-25,"5,500",60,91.67,5.3,0.0,35,35,350,"2,800","2,000",700,0.0

In [36]:
## Filling missing values with the mean of the column
df['sales_fillNa']=df['Average Profit Margin (%)'].fillna(df['Average Profit Margin (%)'].mean())

In [37]:
df

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%),sales_fillNa
0,01-Jul-25,"3,150",38,82.89,3.2,11.0,27,55,280,"1,500","1,050",600,38.0,38.0
1,02-Jul-25,NaN,45,93.33,4.1,18.0,27,42,310,"2,100","1,500",600,NaN,38.5
2,03-Jul-25,"3,800",41,92.68,3.7,15.0,26,48,295,"1,900",NaN,600,39.0,39.0
3,04-Jul-25,"5,500",60,91.67,5.3,NaN,35,35,350,"2,800","2,000",700,NaN,38.5

In [38]:
df.dtypes

Date                              object
Total Sales ($)                   object
Number of Orders                   int64
Average Order Value ($)          float64
Conversion Rate (%)              float64
New Customers                    float64
Returning Customers                int64
Customer Acquisition Cost ($)      int64
Customer Lifetime Value ($)        int64
Product A Sales ($)               object
Product B Sales ($)               object
Product C Sales ($)                int64
Average Profit Margin (%)        float64
sales_fillNa                     float64
dtype: object

In [39]:
#remaining colums 
df.rename(columns={'Date':'sales Date'})

,sales Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%),sales_fillNa
0,01-Jul-25,"3,150",38,82.89,3.2,11.0,27,55,280,"1,500","1,050",600,38.0,38.0
1,02-Jul-25,NaN,45,93.33,4.1,18.0,27,42,310,"2,100","1,500",600,NaN,38.5
2,03-Jul-25,"3,800",41,92.68,3.7,15.0,26,48,295,"1,900",NaN,600,39.0,39.0
3,04-Jul-25,"5,500",60,91.67,5.3,NaN,35,35,350,"2,800","2,000",700,NaN,38.5

In [41]:
#change data types
df['value_new']=df['sales_fillNa'].astype(int)
df

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%),sales_fillNa,value_new
0,01-Jul-25,"3,150",38,82.89,3.2,11.0,27,55,280,"1,500","1,050",600,38.0,38.0,38
1,02-Jul-25,NaN,45,93.33,4.1,18.0,27,42,310,"2,100","1,500",600,NaN,38.5,38
2,03-Jul-25,"3,800",41,92.68,3.7,15.0,26,48,295,"1,900",NaN,600,39.0,39.0,39
3,04-Jul-25,"5,500",60,91.67,5.3,NaN,35,35,350,"2,800","2,000",700,NaN,38.5,38

In [42]:
df['new value']=df['value_new'].apply(lambda x:x**2)
df

,Date,Total Sales ($),Number of Orders,Average Order Value ($),Conversion Rate (%),New Customers,Returning Customers,Customer Acquisition Cost ($),Customer Lifetime Value ($),Product A Sales ($),Product B Sales ($),Product C Sales ($),Average Profit Margin (%),sales_fillNa,value_new,new value
0,01-Jul-25,"3,150",38,82.89,3.2,11.0,27,55,280,"1,500","1,050",600,38.0,38.0,38,1444
1,02-Jul-25,NaN,45,93.33,4.1,18.0,27,42,310,"2,100","1,500",600,NaN,38.5,38,1444
2,03-Jul-25,"3,800",41,92.68,3.7,15.0,26,48,295,"1,900",NaN,600,39.0,39.0,39,1521
3,04-Jul-25,"5,500",60,91.67,5.3,NaN,35,35,350,"2,800","2,000",700,NaN,38.5,38,1444

In [46]:
# merging and joing data frames 
df1=pd.DataFrame({'key':['A','B','C'],'value1':[1,3,5]})
df2=pd.DataFrame({'key':['A','B','D'],'value1':[134,221,451]})

In [49]:
df2

  key  value1
0   A     134
1   B     221
2   D     451

In [51]:
# merge dataframe on the 'key colums'
pd.merge(df1,df2,on="key",how="outer")

  key  value1_x  value1_y
0   A       1.0     134.0
1   B       3.0     221.0
2   C       5.0       NaN
3   D       NaN     451.0

In [52]:
pd.merge(df1,df2,on="key",how="inner")

  key  value1_x  value1_y
0   A         1       134
1   B         3       221

In [53]:
pd.merge(df1,df2,on="key",how="left")

  key  value1_x  value1_y
0   A         1     134.0
1   B         3     221.0
2   C         5       NaN